---
kind: property
id: P:Autodesk.Revit.DB.DWFExportOptions.ImageFormat
source: html/74864de2-e566-0351-471e-09c8343cd906.htm
---
# Autodesk.Revit.DB.DWFExportOptions.ImageFormat Property

Controls the compression level of images embedded.

## Syntax (C#)
```csharp
public DWFImageFormat ImageFormat { get; set; }
```

## Remarks
ImageQuality is ignored when ImageFormat is set to "PNG"-the standard format.